import matplotlib.pyplot as plt
import math


# variant 17


# 1. Построить корреляционное поле. По характеру расположения точек в корреляционном поле выбрать общий вид регрессии.
# 2. Написать уравнение линии регрессии y на x по методу наименьших квадратов и с использованием коэффициента
#       корреляции r . Сравнить полученные уравнения и сделать вывод о выборе одного из них.
# 3. Оценить тесноту связи между признаками X и Y с помощью выборочного коэффициента корреляции r и его значимость.
# 4. Проверить адекватность модельного уравнения регрессии y на x, записанного через коэффициент корреляции r.
# 5. Проверить надежность уравнения регрессии y на x, записанного через коэффициент корреляции r и его коэффициентов.
# 6. Построить уравнения регрессий в первоначальной системе координат.


