import mymodule

# 136o задача из первой практике по теории вычеслительных процессов

print("""
Даны натуральное число n, действительные числа a1,..., an. 
Найти сумму sqrt(10 + ki ** 2)
i от 0 до n 
""")
arr = mymodule.user_input()
print(mymodule.o136(arr))